{
  "id": "gcp-secret-engine",
  "title": "GCP Secret Engine",
  "meta": "KubeVault lets you enable and configure GCP Secret Engine. You can create Secret containing the GCP credentials and also create RBAC Role and RoleBinding.",
  "innerContent": [
    {
      "id": 1,
      "title": "Enable and Configure Secret Engine",
      "description": "Secrets Engines are components which store, generate, or encrypt data. Secrets Engines are incredibly flexible, so it is easiest to think about them in terms of their function. Secrets Engines are provided with some set of data, they take some action on that data, and they return a result. KubeVault lets you enable & configure GCP Secret Engine in a Kubernetes native way.",
      "img": "/assets/images/features/illustrations/enable-and-configure-secret-engine.jpg"
    },
    {
      "id": 2,
      "title": "Role",
      "description": "In a Secret Engine, a role describes an identity with a set of permissions, groups, or policies you want to attach to a user of the Secret Engine. KubeVault operator lets you create GCPRole in a Secret Engine.",
      "img": "/assets/images/features/illustrations/role.jpg"
    },
    {
      "id": 3,
      "title": "Secret Access Request",
      "description": "A SecretAccessRequest is a Kubernetes CustomResourceDefinition (CRD) which allows a user to request a Vault server for credentials in a Kubernetes native way. A SecretAccessRequest can be created under GCPRole that can be enabled in a SecretEngine. KubeVault operator lets you manage your DB user privileges with dynamic secrets rather than hard-coded credentials using SecretAccessRequest. This means that services that need to access a database no longer need to hardcode credentials.",
      "img": "/assets/images/features/illustrations/secret-access-request.jpg"
    },
    {
      "id": 4,
      "title": "Secret Role Binding",
      "description": "A SecretRoleBinding is a Kubernetes CustomResourceDefinition (CRD) which allows a user to bind a set of roles to a set of users. Using the SecretRoleBinding it’s possible to bind GCPRole to Kubernetes ServiceAccounts. This way is more machine friendly and convenient for running your application with specific permissions.",
      "img": "/assets/images/features/illustrations/secret-role-binding.jpg"
    }
  ]
}
